//
//  SignUpModel.swift
//  Koting
//
//  Created by 임정우 on 2021/03/24.
//

import Foundation

let domain = "@dgu.ac.kr"

let sexArray = ["남자", "여자"]

let collegeArray = ["불교대학",
                    "문과대학",
                    "이과대학",
                    "법과대학",
                    "사회과학대학",
                    "경찰사법대학",
                    "경영대학",
                    "바이오시스템대학",
                    "공과대학",
                    "사범대학",
                    "예술대학",
                    "약학대학",
                    "미래융합대학"]

let majorDict: [String:[String]] = [
    "불교대학" : ["불교학부"],
    "문과대학" :  ["국어국문문예창작학부","영어문학전공","영어통번역학전공","일본학과","중어중문학과","철학과","사학과","윤리문화학전공"],
    "이과대학" : ["수학과","화학과","통계학과","물리반도체과학부"],
    "법과대학" : ["법학과"],
    "사회과학대학" : [ "정치외교학전공","행정학전공","북한학전공","경제학과","국제통상학과","사회학전공","미디어커뮤니케이션전공","식품산업관리학과","광고홍보학과","사회복지학과"],
    "경찰사법대학" : ["경찰행정학부"],
    "경영대학" : ["경영학과","회계학과","경영정보학과"],
    "바이오시스템대학" : ["바이오환경과학과","생명과학과","식품생명공학과","의생명공학과"],
    "공과대학" : [ "건설환경공학과","건축학전공","건축공학전공","기계로봇에너지공학과","멀티미디어공학과","산업시스템공학과","융합에너지신소재공학과","전자전기공학부","정보통신공학전공","컴퓨터공학전공","화공생물공학과"],
    "사범대학" : ["교육학과","국어교육과","역사교육과","지리교육과","수학교육과","가정교육과","체육교육과"],
    "예술대학" : ["미술학부","연극학부","영상영화학과","스포츠문화학과"],
    "약학대학" : ["약학과"],
    "미래융합대학" : ["융합보안학과","사회복지상담학과","글로벌무역학과"]
]

let mbtiArray = ["ENFJ",
                 "ENFP",
                 "ENTJ",
                 "ENTP",
                 "ESFJ",
                 "ESFP",
                 "ESTJ",
                 "ESTP",
                 "INFJ",
                 "INFP",
                 "INTJ",
                 "INTP",
                 "ISFJ",
                 "ISFP",
                 "ISTJ",
                 "ISTP"]

let ageArray: [String] = {
    var arr = [String]()
    for n in 20...29 {
        arr.append(String(n))
    }
    return arr
}()

let heightArray: [String] = {
    var arr = [String]()
    for n in 140...200 {
        arr.append(String(n))
    }
    return arr
}()
